/**
 * @Description: 基本信息
 * @author:clearlove
 * @param 
 * @return 
 * @createTime: 2024-01-18 10:59:10
 */

// pink、red、cyan、green、purple、volcano、magenta

export const baseInfo = [{
		title: '姓名',
		enTitle: 'Name',
		display: 'CLEARLOVE',
		explain: '标识和区分个体的一个重要标识符',
		label: `It's me`,
		color: '#FF3030',
		tags: [{
			tagColor: '',
			tagName: ''
		}]
	},
	{
		title: '兴趣',
		enTitle: 'interest',
		display: '', // 单个展示
		explain: '个体对某种事物、活动、领域或主题的强烈喜好或关注',
		label: `It's me`,
		color: '#FF7F24',
		// 多个展示
		tags: [{
				tagColor: '#1d3f22',
				tagName: '写博客'
			},
			{
					tagColor: '#CD853F',
					tagName: '开车'
				},
			{
				tagColor: '#f40',
				tagName: '唱歌'
			},
			{
				tagColor: '#89998b',
				tagName: '篮球 🏀'
			},
			{
				tagColor: '#1d3f22',
				tagName: '书法'
			},
			{
				tagColor: '#1d3f22',
				tagName: '双节棍'
			},
			{
				tagColor: '#1d3f22',
				tagName: '游戏'
			}
		]
	},
	{
		title: '专业领域',
		enTitle: 'Professional field',
		display: '', // 单个展示
		explain: '在特定学科、行业或领域内所涉及的特定知识、技能、经验和专业实践的范围。每个专业领域都有其独特的特征和要求，涉及到特定领域的专业知识和技术',
		label: `It's me`,
		color: '#FF1493',
		// 多个展示
		tags: [{
				tagColor: '#4876FF',
				tagName: 'web前端'
			},
			{
				tagColor: '#0000CD',
				tagName: 'vue[2/3]'
			},
			{
				tagColor: '#00008B',
				tagName: 'ElementUi[plus]'
			},
			{
				tagColor: '#104E8B',
				tagName: 'VantUi'
			},
			{
				tagColor: '#00688B',
				tagName: 'Antdv'
			},
			{
				tagColor: '#4A708B',
				tagName: 'jQuery'
			},
			{
				tagColor: '#1C1C1C',
				tagName: 'javaScript'
			},
			{
				tagColor: '#008B8B',
				tagName: 'css[3]'
			},
			{
				tagColor: '#36648B',
				tagName: 'H5'
			},
			{
				tagColor: '#838B8B',
				tagName: '小程序'
			},
			{
				tagColor: '#1C86EE',
				tagName: '混合开发'
			},
			{
				tagColor: '#0000EE',
				tagName: 'Git'
			},
			{
				tagColor: '#436EEE',
				tagName: 'NodeJs'
			},
			
		]
	},
	{
		title: '文化和艺术',
		enTitle: 'Culture and Art',
		display: '', // 单个展示
		explain: '个体对某种事物、活动、领域或主题的强烈喜好或关注、标识和区分个体的一个重要标识符、标识和区分个体的一个重要标识符',
		label: `It's me`,
		color: '#D02090',
		// 多个展示
		tags: [{
				tagColor: '#5F9EA0',
				tagName: '刷B站'
			},
			{
				tagColor: '#2E8B57',
				tagName: '看三国'
			},
			{
				tagColor: '#20B2AA',
				tagName: '看书法'
			}
		]
	},
	{
		title: '游戏 🎮',
		enTitle: 'Games',
		display: '', // 单个展示
		explain: '一种有规则的娱乐活动，通常涉及一个或多个玩家，他们通过遵循特定的规则和目标来参与。游戏可以采用多种形式，包括棋盘游戏、纸牌游戏、电子游戏等',
		label: `It's me`,
		color: '#EE4000',
		// 多个展示
		tags: [{
				tagColor: '#f40',
				tagName: 'LOL'
			},
			{
				tagColor: '#FF8C00',
				tagName: '地平线5'
			},
			{
				tagColor: '#F08080',
				tagName: '欧卡2'
			},
			{
				tagColor: '#FF69B4',
				tagName: '罪恶都市'
			},
			{
				tagColor: '#DB7093',
				tagName: '极品飞车'
			},
			{
				tagColor: '#D02090',
				tagName: '玩家国度'
			}
		]
	},
	{
		title: '认证和资格',
		enTitle: 'Certification and Qualification',
		display: '', // 单个展示
		explain: '为了在某个专业领域中从事相关工作，通常需要获得相应的学历、认证或资格。这些可能是行业标准，确保从业者具备必要的专业背景和能力',
		label: `It's me`,
		color: '#9B30FF',
		// 多个展示
		tags: [{
				tagColor: '#f40',
				tagName: 'CSDN博客专家'
			},
			{
				tagColor: '#89998b',
				tagName: 'CSDN认证前端领域优质创作者'
			},
			{
				tagColor: '#668B8B',
				tagName: '2020年CSDN博客之星'
			},
			{
				tagColor: '#FF3030',
				tagName: '网易音乐人'
			}
		]
	},
	{
		title: '目标和愿望',
		enTitle: 'Goals and aspirations',
		display: '', // 单个展示
		explain: '目标：具体、可测量、可实现的目标或结果，通常与计划、努力和时间表相关联。目标是一种有明确方向的愿望，它需要明确的步骤和努力来实现。目标通常是可以量化和具体衡量的，愿望：对某种愿景、梦想或期望的表达，它可能不够具体、可测量或有实质性计划。愿望通常是一种更抽象、更情感化的渴望，可能没有具体的行动计划',
		label: `It's me`,
		color: '#8B0000',
		// 多个展示
		tags: [{
				tagColor: '#f40',
				tagName: '祖国统一'
			},
			{
				tagColor: '#6B8E23',
				tagName: '世界和平'
			},
		]
	},
	{
		title: '个性特点',
		enTitle: 'Personality traits',
		display: '', // 单个展示
		explain: '体在心理、行为和情感方面表现出来的相对一致的、稳定的特征和倾向。这些特点影响着个体与他人互动、应对环境、处理情绪以及做出决策的方式。个性特点是个体独特而持久的心理构造，通常在长期内保持相对的稳定性，但也可以在某些情境下发生一定的变化',
		label: `It's me`,
		color: '#228B22',
		// 多个展示
		tags: [{
				tagColor: '#FF6347',
				tagName: '逗比'
			},
			{
				tagColor: '#CD5C5C',
				tagName: '闷骚'
			},
			{
				tagColor: '#F4A460',
				tagName: '开玩笑'
			},
			{
				tagColor: '#FA8072',
				tagName: '开朗'
			},
			{
				tagColor: '#FF6347',
				tagName: '搞怪'
			},
			{
				tagColor: '#FF1493',
				tagName: '粗中带细'
			},
			{
				tagColor: '#DB7093',
				tagName: '尽职尽责'
			},
			{
				tagColor: '#EE82EE',
				tagName: '放荡不羁爱自由'
			},
			{
				tagColor: '#BA55D3',
				tagName: '维护世界和平全靠我'
			},
		]
	},
	{
		title: '职业目标或理念',
		enTitle: 'Career goals or beliefs',
		display: '', // 单个展示
		explain: '短期目标： 指的是你在较短时间内（通常是一到两年）希望实现的职业目标。这可能包括在当前职位上获得晋升、学习新技能、参与特定项目等。中长期目标： 是指在更长的时间范围内（三到五年或更长时间）你希望达到的职业目标。这可能包括担任更高级别的职务、领导项目团队、转行到特定领域等。职业理念是关于你对工作和职业的核心信念和价值观的表达。这可能包括你对专业道德的看法、对团队合作和领导的态度、对持续学习的重视等。职业理念通常反映了你的职业行为和决策的基本原则',
		label: `It's me`,
		color: '#D02090',
		// 多个展示
		tags: [{
				tagColor: '#F08080',
				tagName: '前端技术大牛'
			},
			{
				tagColor: '#9932CC',
				tagName: '驾驶界的老司机'
			},
			{
				tagColor: '#9370DB',
				tagName: '全栈工程师'
			},
			{
				tagColor: '#FF3030',
				tagName: '专业音乐人'
			}
		]
	},
	{
		title: '等等',
		enTitle: 'wait a minute',
		display: '持续更新中...', // 单个展示
		explain: '也许还有很多...更新中',
		label: `It's me`,
		color: '#D02090',
		// 多个展示
		tags: []
	}
]